//صفحة لهرض البوستات  وبعرض فقط عنوانين البوستات بوضعها داخل link لنكون كرتبط عند النقر علي اي عن ان يتحول لصفحة الpostdetailes ليهرض تفاصيل ذلك البوست وده من خلال ال id بتاع البوست المنضغط عليه

import { Link } from "react-router-dom";
//استيراد ملف انشاء الكونتكست
import { postContext } from "./Postcontext.js";
import React, { useContext } from "react";

export default function Posts() {
  //تخزين القايمة في المتغير Posts واللي اخدها من اليوزكونتكست اللي اخدتها من من الpostContext اللي احاط بالكود كله هناك وتم امداده بقيمة القابمة كلها
  const Posts = useContext(postContext);

  /*id لارساله لضفحة التفاصيل مع البوست او العنوان المنضغط عليه وال id كمفتاح لكل عنوان بوست يميزه عن غيره فب العرض كترتيب من رياكت */
  let myPosts = Posts.map((post) => {
    //وضع اسم البريفكس بوستسس قبل الاي دي بدل postdetails لانه اصبحت نسيتد nested داخل layout واحد ومرجعه posts كاسم للكل والمرتبط به نضع فقط اسم للصفحة او مايدل عليها ولانضع سلاش لانها موصوعه هناك في البريفكسposts في وسم الروت الاساسي اللي بيغلفهم
    //ولم اذكر الpostdetails بالاخص وءكرت فقط انه تحول الي الiD لانه البوست ديتيايز هي الوحيدة هنا اللي بتتلقي الاي دي بالuseParams فعند النثر علي عنوان البوست هيتحول لها وانا حاطط لها هناك :iD في المسار
    return (
      <>
       {/* تحديد المفتاح لكل عنوان بوست وده للترتيب وتوصي به رياكت عشان تميز طل بوست عن غيره وبعده كده ارسال الاي دي نفسه في الurlعند النقر علي اي عنوان بوست يوجهه لصفحة التفاصيل ليه ومعاه الاي دي اللي بيساوي ال id بتاع المفتاح ايضا وعشان اليوز بارامز تستخرجه من اليurl  وتخزنه فيها 
           وبكده كل عنوان بوست هيظهر تفاصيله هو فقط لانه اتحدد بالادي المبهوث معاه لصفحة التفاصيل واستخراج التفاصيل هناك الtitle . body 
           والposts ده البريفكس الخاص بمسارات الصفحات بتاعة البوستسات وبيمثل هنا التوجه لصفحة التفاصيل عند النقر علي العنوان ياخد الاي دي يضعه في ال url لتستخرجة البارامز واستخرج بيه التفاصيل للبوست */}
        <Link key={post.id} to={`/posts/${post.id}`}>
          <div
            style={{ background: "orange", padding: "20px", marginTop: "10px" }}
          >
            <h1>{post.title}</h1>
          </div>
        </Link>
      </ >
    );
  });
  return (
    <>
      {myPosts}

      {/*روابط الذهاب للصفحات الاخري المتعلقة بالبوستات* ووضعت  سلاش قبلها لانه ندمتداخله وواضع قبلها البرفكس /posts للطل كمرجع او بداية لكل الصفحات اللي جوه الغلاف المحدد لهم يعني هنا هحتاج احط البربفكس لكن في الكومب الاستسي في الغلاف بتاعهم مش هحااج فكده بقوله روح لصغحة ال Newpost مثلا عند النقر علي اللينك بتاع الاضافة لانه nee تمثل الكمب Newpost وقبلها سلاش الكلمة التفتتاحية والمرجعية البريغكس prefex */}

      {/*هنا ممكنب ال new مباشرة دون البريفكس posts لانه يعتبر الابن بتاعه ويسمي اللينك بتاع new  relative link نسبة الي الاب بتاعه posts  لكن في الاعلي في المتب طنب بوستس قبل الاي دي لان بوستس ده اصسم الصفحة نغسها اللي كانت باسم تو نفس اسم البريفكس وخليناها index */}
      <Link to="new">
        <button> go to new post to adding</button>
      </Link>
      <Link to="delete">
        <button> go to delete post</button>
      </Link>

      {/*راوبط الذهاب الي الهوم   */}
      <Link to="/">
        <button> go home</button>
      </Link>
    </>
  );
}
